app/controllers/game_controller.rb

  def index
    if request.post?
      redirect_to :controller => 'game', :gid => params[:new_gid]
    end

    @parser = nil
    flash[:error] = nil

    game_number = getGameNumber
    return if !game_number

    @game = Game.find(:first, :conditions => ["lg_game_num = ?", game_number])
---
SELECT * FROM `games` WHERE (lg_game_num = 772607) LIMIT 1