app/controllers/jtwixt_controller.rb

SELECT * FROM `games` WHERE (lg_game_num = '772607') LIMIT 1
---
  def gen
    game_id = params[:gameid]
    game = Game.find(:first, :conditions => ["lg_game_num = ?", game_id]) || getGameFromLittleGolem(game_id)