app/controllers/main_page_controller.rb

  def index
    @commented_games =
      Game.paginate(:page => params[:page],
        :per_page => 20,
        :order => 'last_commented_on DESC',
        :conditions => ['last_commented_on is not null'])
---
SELECT * FROM `games` WHERE (last_commented_on is not null) ORDER BY last_commented_on DESC LIMIT 0, 20
SELECT count(*) AS count_all FROM `games` WHERE (last_commented_on is not null)