app/controllers/rss_feed_controller.rb

  def show
    comment = Comment.find(params[:id])
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 298)