app/controllers/user_controller.rb

  def info
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 4)

  def profile
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 4)